/** @jsxImportSource @emotion/react */
import React from "react";
import * as S from "./Style";

const DetailContent = () => {
  return (
    <div css={S.Positioner}>
      새로움과 배움이 가득했던 대학생활과 달리 회사는 생각보다 정적이었다.
      사람들이 열광하는 서비스를 만들어나가고 싶었는데, 그런 팀으로 가지는
      못했다. 개발을 많이 할 수 있는 팀으로 갔지만, 사람들이 열광하는 서비스를
      만들어갈 기회를 얻지는 못했다. 경력을 쌓고 나가야겠다는 생각도 했다. 잠시
      스쳐지나가는 프로젝트들을 하겠지만, 개발을 좋아하기 때문에 열심히 배운다면
      성장할 것이라고 생각했다. 그러다가 다른 곳에 붙어서 나간다면 그것이
      최선이었다. 하지만 면접의 벽은 높았다. 면접을 볼때마다 회사일이 바쁘다는
      핑계로 소홀히 해온 기본기의 중요성을 느꼈다. 아직은 준비가 안된 것이었고,
      그렇기 때문에 탈락할수 밖에 없었다. 기본기를 쌓아야 했다. 그리고 그러기
      위해서는 지금 회사를 나와야 했다. 회사는 기본기를 닦는 것보다는 빠르게
      제품을 찍어내는 것을 선호했는데, 요구사항에 맞추기 위해 새벽과 주말을
      통째로 갈아넣다보니 다른 일을 할 엄두가 나지 않았다. 그러다가 어느날,
      회사의 문화에 젖어들고 있는 나를 발견하게 되었다. 퇴근시간이 넘으면 퇴근
      하는 것이 당연한 일인데, 사소한 에러를 해결하지 않고 퇴근하는 동기를 보며
      화가 났다. 그리고 동시에 내 모습이 너무 낯설었다. 몇달 전 밤을 새면서
      개발하는 것이 당연하다는 듯 말하는 부서장을 보며 나는 저런 선배가 되지
      말아야겠다고 그렇게 다짐했었는데, 그렇게 수직적이고 강압적인 분위기를
      싫어하던 나에게 그 부서장의 모습이 보였다. 그래서 느꼈다. 더 늦기 전에
      나가야 한다고. 마무리 합니다. 또 궁금하신 사항은 디스코드를 통해서
      해주시면 감사하겠습니다.~~ 많은 신청 부탁드려용
    </div>
  );
};

export default DetailContent;
